<a href="https://colab.research.google.com/github/fidslk/FDA_test/blob/main/Rough_workings_for_explanations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df2 = pd.DataFrame({'name':['John', 'John', 'John', 'Tom', 'Sim', 'Sim'],
                    'store_label':['John', 'John', 'John', 'Tom', 'Tom', 'Tom'],
                    'created_date':['01/02/2021  05:37:22','21/02/2021  05:38:06','21/02/2021  05:38:50','21/02/2021  06:35:25','22/02/2021  13:03:05','22/02/2021  13:05:05'],
                   'created_date2':['01.02.2021  05:37:22','21.02.2021  05:38:06','21.02.2021  05:38:50','21.02.2021  06:35:25','22.02.2021  13:03:05','22.02.2021  13:05:05']})

In [ ]:
df2

   name store_label          created_date         created_date2
0  John        John  01/02/2021  05:37:22  01.02.2021  05:37:22
1  John        John  21/02/2021  05:38:06  21.02.2021  05:38:06
2  John        John  21/02/2021  05:38:50  21.02.2021  05:38:50
3   Tom         Tom  21/02/2021  06:35:25  21.02.2021  06:35:25
4   Som         Tom  22/02/2021  13:03:05  22.02.2021  13:03:05
5   Som         Tom  22/02/2021  13:05:05  22.02.2021  13:05:05

### Adding a unique reference column

In [ ]:
df2["My_Ref"] = "some thing"

In [ ]:
df2= df2[[ 'My_Ref','name', 'store_label', 'created_date']]

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   My_Ref        6 non-null      int64
 1   My_Ref2       6 non-null      object
 2   name          6 non-null      object
 3   store_label   6 non-null      object
 4   created_date  6 non-null      object
dtypes: int64(1), object(4)
memory usage: 368.0+ bytes

In [ ]:
del df2['My_Ref']

In [ ]:
df2 = df2.reset_index(drop=True)
df2 = df2.rename_axis('My_Ref').reset_index()

In [ ]:
df2

   My_Ref  name store_label          created_date
0       0  John        John  21/02/2021  05:37:22
1       1  John        John  21/02/2021  05:38:06
2       2  John        John  21/02/2021  05:38:50
3       3   Tom         Tom  21/02/2021  06:35:25
4       4   Som         Tom  22/02/2021  13:03:05
5       5   Som         Tom  22/02/2021  13:05:05

In [ ]:
for i in range(1,7):
    print(i)

1
2
3
4
5
6

In [ ]:
df2.shape[0]+1

7

In [ ]:
for i in range(1,df2.shape[0]+1):
    #print(i)
    print(f'My_Ref_{i:04d}')

My_Ref_0001
My_Ref_0002
My_Ref_0003
My_Ref_0004
My_Ref_0005
My_Ref_0006

In [ ]:
print([f'My_ref_{i:04d}' for i in range(1,df2.shape[0]+1)])

['My_ref_0001', 'My_ref_0002', 'My_ref_0003', 'My_ref_0004', 'My_ref_0005', 'My_ref_0006']

In [ ]:
df2["My_Ref2"] =[f'My_ref_{i:04d}' for i in range(1,df2.shape[0]+1)]

In [ ]:
df2= df2[[ 'My_Ref','My_Ref2','name', 'store_label', 'created_date']]
df2

   My_Ref      My_Ref2  name store_label          created_date
0       0  My_ref_0001  John        John  21/02/2021  05:37:22
1       1  My_ref_0002  John        John  21/02/2021  05:38:06
2       2  My_ref_0003  John        John  21/02/2021  05:38:50
3       3  My_ref_0004   Tom         Tom  21/02/2021  06:35:25
4       4  My_ref_0005   Som         Tom  22/02/2021  13:03:05
5       5  My_ref_0006   Som         Tom  22/02/2021  13:05:05

In [ ]:
df2.insert(1, 'My_Ref2', df2.pop('My_Ref2'))

In [ ]:
df2

   My_Ref      My_Ref2  name store_label          created_date
0       0  My_ref_0001  John        John  21/02/2021  05:37:22
1       1  My_ref_0002  John        John  21/02/2021  05:38:06
2       2  My_ref_0003  John        John  21/02/2021  05:38:50
3       3  My_ref_0004   Tom         Tom  21/02/2021  06:35:25
4       4  My_ref_0005   Som         Tom  22/02/2021  13:03:05
5       5  My_ref_0006   Som         Tom  22/02/2021  13:05:05

### Change a date in a string format into a datetime format

In [ ]:
df2['created_date'] = pd.to_datetime(df2['created_date'])

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           6 non-null      object
 1   store_label    6 non-null      object
 2   created_date   6 non-null      datetime64[ns]
 3   created_date2  6 non-null      datetime64[ns]
dtypes: datetime64[ns](2), object(2)
memory usage: 320.0+ bytes

In [ ]:
df2['created_date2'] = pd.to_datetime(df2['created_date2'])

In [ ]:
df2.head()

   name store_label        created_date       created_date2
0  John        John 2021-01-02 05:37:22 2021-01-02 05:37:22
1  John        John 2021-02-21 05:38:06 2021-02-21 05:38:06
2  John        John 2021-02-21 05:38:50 2021-02-21 05:38:50
3   Tom         Tom 2021-02-21 06:35:25 2021-02-21 06:35:25
4   Som         Tom 2021-02-22 13:03:05 2021-02-22 13:03:05

In [ ]:
df2['created_date_new'] = pd.to_datetime(df2['created_date'], format='%d/%m/%Y %H:%M:%S')

In [ ]:
df2['created_date2_new'] = pd.to_datetime(df2['created_date2'], format='%d.%m.%Y %H:%M:%S')

In [ ]:
df2['created_date_OnlyDate'] = pd.to_datetime(pd.to_datetime(((df2['created_date']).str[:])).dt.strftime('%d/%m/%Y'), format='%d/%m/%Y')
df2['created_date_OnlyDate2'] = pd.to_datetime(pd.to_datetime(((df2['created_date2']).str[:])).dt.strftime('%d.%m.%Y'), format='%d.%m.%Y')

In [ ]:
df2

,name,store_label,created_date,created_date2,created_date_new,created_date2_new,created_date_OnlyDate,created_date_OnlyDate2
0,John,John,01/02/2021 05:37:22,01.02.2021 05:37:22,2021-02-01 05:37:22,2021-02-01 05:37:22,2021-02-01,2021-02-01
1,John,John,21/02/2021 05:38:06,21.02.2021 05:38:06,2021-02-21 05:38:06,2021-02-21 05:38:06,2021-02-21,2021-02-21
2,John,John,21/02/2021 05:38:50,21.02.2021 05:38:50,2021-02-21 05:38:50,2021-02-21 05:38:50,2021-02-21,2021-02-21
3,Tom,Tom,21/02/2021 06:35:25,21.02.2021 06:35:25,2021-02-21 06:35:25,2021-02-21 06:35:25,2021-02-21,2021-02-21
4,Som,Tom,22/02/2021 13:03:05,22.02.2021 13:03:05,2021-02-22 13:03:05,2021-02-22 13:03:05,2021-02-22,2021-02-22
5,Som,Tom,22/02/2021 13:05:05,22.02.2021 13:05:05,2021-02-22 13:05:05,2021-02-22 13:05:05,2021-02-22,2021-02-22